/*---------------------------------------------------
두수 a,b에 대한 절대값을 반환하는함수!!
---------------------------------------------------*/
function getAbs(a, b){
    return Math.abs(a-b); //함수를 호출한 실행부가 결과를 가지고 
                                    //호출한곳으로 되돌아감
}

/*---------------------------------------------------
랜덤 구하는 함수
n을 넣으면, 0~n까지 포함하여 반환하는 함수
---------------------------------------------------*/
function getRandom(n){
    //3
    var r = Math.random();  //1 보다 작은 실수  0.0xxx ~ 0.9xxxxx
    return Math.floor((n+1) * r); //소수점을 버린다
}







